# Словарь вопросов, ответов и баллов
questions = {
    "1": [
        "Какой результат выполнения следующего кода?\n"
        "x = 10\n"
        "if x > 5:\n"
        "print(x больше 5)\n"
        "else:\n"
        "print(x меньше или равен 5)\n",
        ["1. х больше 5", "2. null", "3. х меньше или равен 5", "4. IOException"],
        1
    ],
    "2": [
        "Какой будет результат выполнения следующего кода?\n"
        "i = 0\n" ""
        "while i < 5:\n"
        "print(i)\n"
        "i += 1\n"
        "if i == 3:\n"
        "break",
        ["1. 0 1 2", "2. 0 1 2 3 4", "3. 0 1 2 3", "4. 0 1 2 3 4 5"],
        1
    ],
    "3": [
        "Какой будет результат выполнения следующего кода?\n"
        "numbers = [1, 2, 3, 4, 5]\n"
        "for num in numbers:\n"
        "if num == 3:\n"
        "continue\n"
        "print(num)",
        ["1. 1 2 3 4 5", "2. 1 2 4 5", "3. 1 2 4 5 6", "4. 1 2 4"],
        2
    ],
    "4": [
        "Какой метод используется для удаления последнего элемента из списка?",
        ["1. apppend()", "2. remove()", "3. clear()", "4. delete"],
        2
    ],
    "5": [
        "К какому типу данных относятся словари?",
        ["1. str", "2. list", "3. set", "4. dict"],
        4
    ],
    "6": [
        "Какой метод используется для сортировки списка?",
        ["1. split()", "2. reverse()", "3. sort()", "4. descending()"],
        3
    ],
    "7": [
        "Какой будет результат выполнения следующего кода?\n"
        "def calculate_sum(a, b):"
        "return a + b"

        "result = calculate_sum(5, 10)"
        "print(result)",
        ["1. '15'", "2. 15", "3. '510'", "4. TypeError"],
        2
    ],
    "8": [
        "Какой метод используется для чтения содержимого текстового файла?",
        ["1. write()", "2. read()", "3. append()", "4. open()"],
        4
    ],
    "9": [
        "3 кита ООП, какое слово лишнее?",
        ["1. Полиморфизм", "2. Конвертация", "3. Инкапсуляция", "4. Наследование"],
        2
    ],
    "10": [
        "Что нужно ввести вначале, чтобы использовать библиотеку math?",
        ["1. Написать export math", "2. Написать use math", "3. Ничего, библиотека math встроена базово", "4. import math"],
        4
    ]
}